
l=['投资时点', '起投金额', '优惠', '期限', '基金经理', '投后', '是否分红', '预警', '最低持有份额', '封闭期', '到账时间', '净值更新频率', '推荐产品', '冷静期', '募集时间', '运作费用', '预期收益率', '追加起投', '收益分配', '产品推荐', '认申购费', '赎回规则', '投资范围', '分红', '标的', '投资策略', '资产配置', '折扣', '管理人', '什么是预约', '产品类型', '业绩报酬', '下次募集时间', '保本', '历史业绩', '风险等级', '止损', '赎回时间', '什么是私募', '定期报告']

l2=['预期收益率', '投资策略', '投资范围', '赎回时间', '什么是预约', '净值更新频率', '分红', '投后', '冷静期', '资金配置', '赎回规则', '追加起投', '运作费用', '是否分红', '优惠', '投资时点', '什么是私募', '收益分配', '管理人', '期限', '历史业绩', '起投金额', '定期报告', '基金经理', '折扣', '标的', '认申购费', '推荐产品', '下次募集时间', '资产配置', '业绩报酬', '最低持有份额', '到账时间', '风险等级', '募集时间', '产品类型', '保本', '封闭期', '止损']

l.sort()

print([e for e in l])

l2.sort()
print([e for e in l2])